Ran Apply for dir: `.` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running "terragrunt apply -input=false -no-color" in "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default": exit status 1: running "terragrunt apply -input=false -no-color" in "/home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default": 
08:54:05.295 INFO   Downloading Terraform configurations from file:///home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default into /home/ec2-user/.atlantis/repos/amitkarpe/atlantis-test/15/default/.terragrunt-cache/NIxP4CnB6NyWArMMrWwAn5uP49g/94L9FtUqOi2mI3xu-vftdOJ_X-Y
08:54:05.527 STDOUT terraform: Initializing the backend...
08:54:05.632 STDOUT terraform: Successfully configured the backend "s3"! Terraform will automatically
08:54:05.632 STDOUT terraform: use this backend unless the backend configuration changes.
08:54:05.706 STDOUT terraform: Initializing provider plugins...
08:54:05.706 STDOUT terraform: - Reusing previous version of hashicorp/random from the dependency lock file
08:54:05.721 STDOUT terraform: - Reusing previous version of hashicorp/aws from the dependency lock file
08:54:05.811 STDOUT terraform: - Using hashicorp/random v3.6.3 from the shared cache directory
08:54:08.132 STDOUT terraform: - Using hashicorp/aws v5.69.0 from the shared cache directory
08:54:12.355 STDOUT terraform: Terraform has been successfully initialized!
08:54:12.355 STDOUT terraform: You may now begin working with Terraform. Try running "terraform plan" to see
08:54:12.355 STDOUT terraform: any changes that are required for your infrastructure. All Terraform commands
08:54:12.355 STDOUT terraform: should now work.
08:54:12.355 STDOUT terraform: If you ever set or change modules or backend configuration for Terraform,
08:54:12.355 STDOUT terraform: rerun this command to reinitialize your working directory. If you forget, other
08:54:12.355 STDOUT terraform: commands will detect it and remind you to do so if necessary.
08:54:18.268 STDOUT terraform: random_pet.bucket_name: Refreshing state... [id=unduly-eminent-primate]
08:54:18.521 STDOUT terraform: aws_s3_bucket.test_bucket: Refreshing state... [id=atlantis-terragrunt-test-unduly-eminent-primate]
08:54:19.166 STDOUT terraform: Terraform used the selected providers to generate the following execution
08:54:19.167 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
08:54:19.167 STDOUT terraform: -/+ destroy and then create replacement
08:54:19.167 STDOUT terraform: Terraform will perform the following actions:
08:54:19.171 STDOUT terraform:   # aws_s3_bucket.test_bucket must be replaced
08:54:19.171 STDOUT terraform: -/+ resource "aws_s3_bucket" "test_bucket" {
08:54:19.171 STDOUT terraform:       + acceleration_status         = (known after apply)
08:54:19.171 STDOUT terraform:       + acl                         = (known after apply)
08:54:19.171 STDOUT terraform:       ~ arn                         = "arn:aws:s3:::atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ bucket                      = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply) # forces replacement
08:54:19.171 STDOUT terraform:       ~ bucket_domain_name          = "atlantis-terragrunt-test-unduly-eminent-primate.s3.amazonaws.com" -> (known after apply)
08:54:19.171 STDOUT terraform:       + bucket_prefix               = (known after apply)
08:54:19.171 STDOUT terraform:       ~ bucket_regional_domain_name = "atlantis-terragrunt-test-unduly-eminent-primate.s3.ap-southeast-1.amazonaws.com" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ hosted_zone_id              = "Z3O0J2DXBE1FTB" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ id                          = "atlantis-terragrunt-test-unduly-eminent-primate" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ object_lock_enabled         = false -> (known after apply)
08:54:19.171 STDOUT terraform:       + policy                      = (known after apply)
08:54:19.171 STDOUT terraform:       ~ region                      = "ap-southeast-1" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
08:54:19.171 STDOUT terraform:       - tags                        = {} -> null
08:54:19.171 STDOUT terraform:       ~ tags_all                    = {} -> (known after apply)
08:54:19.171 STDOUT terraform:       + website_domain              = (known after apply)
08:54:19.171 STDOUT terraform:       + website_endpoint            = (known after apply)
08:54:19.171 STDOUT terraform:         # (1 unchanged attribute hidden)
08:54:19.171 STDOUT terraform:       ~ cors_rule (known after apply)
08:54:19.171 STDOUT terraform:       ~ grant (known after apply)
08:54:19.171 STDOUT terraform:       - grant {
08:54:19.171 STDOUT terraform:           - id          = "9f83ffd5bd78abb53e8b9de59f80f4efce23bffeeef98c1cab7e0b3e28cabbd4" -> null
08:54:19.171 STDOUT terraform:           - permissions = [
08:54:19.171 STDOUT terraform:               - "FULL_CONTROL",
08:54:19.171 STDOUT terraform:             ] -> null
08:54:19.171 STDOUT terraform:           - type        = "CanonicalUser" -> null
08:54:19.171 STDOUT terraform:             # (1 unchanged attribute hidden)
08:54:19.171 STDOUT terraform:         }
08:54:19.171 STDOUT terraform:       ~ lifecycle_rule (known after apply)
08:54:19.171 STDOUT terraform:       ~ logging (known after apply)
08:54:19.171 STDOUT terraform:       ~ object_lock_configuration (known after apply)
08:54:19.171 STDOUT terraform:       ~ replication_configuration (known after apply)
08:54:19.171 STDOUT terraform:       ~ server_side_encryption_configuration (known after apply)
08:54:19.171 STDOUT terraform:       - server_side_encryption_configuration {
08:54:19.171 STDOUT terraform:           - rule {
08:54:19.171 STDOUT terraform:               - bucket_key_enabled = false -> null
08:54:19.171 STDOUT terraform:               - apply_server_side_encryption_by_default {
08:54:19.171 STDOUT terraform:                   - sse_algorithm     = "AES256" -> null
08:54:19.171 STDOUT terraform:                     # (1 unchanged attribute hidden)
08:54:19.171 STDOUT terraform:                 }
08:54:19.171 STDOUT terraform:             }
08:54:19.171 STDOUT terraform:         }
08:54:19.171 STDOUT terraform:       ~ versioning (known after apply)
08:54:19.171 STDOUT terraform:       - versioning {
08:54:19.171 STDOUT terraform:           - enabled    = false -> null
08:54:19.171 STDOUT terraform:           - mfa_delete = false -> null
08:54:19.171 STDOUT terraform:         }
08:54:19.171 STDOUT terraform:       ~ website (known after apply)
08:54:19.171 STDOUT terraform:     }
08:54:19.171 STDOUT terraform:   # random_pet.bucket_name must be replaced
08:54:19.171 STDOUT terraform: -/+ resource "random_pet" "bucket_name" {
08:54:19.171 STDOUT terraform:       ~ id        = "unduly-eminent-primate" -> (known after apply)
08:54:19.171 STDOUT terraform:       ~ length    = 3 -> 6 # forces replacement
08:54:19.171 STDOUT terraform:         # (1 unchanged attribute hidden)
08:54:19.171 STDOUT terraform:     }
08:54:19.171 STDOUT terraform: Plan: 2 to add, 0 to change, 2 to destroy.
08:54:19.171 STDOUT terraform: Do you want to perform these actions?
08:54:19.171 STDOUT terraform:   Terraform will perform the actions described above.
08:54:19.171 STDOUT terraform:   Only 'yes' will be accepted to approve.
08:54:19.171 STDOUT terraform:   Enter a value: 
08:56:51.265 STDOUT terraform: Interrupt received.
08:56:51.265 INFO   Terminated signal received. Gracefully shutting down... (it can take up to 30s)
08:56:51.265 STDOUT terraform: Error: error asking for approval: context canceled
08:56:51.265 STDOUT terraform: Please wait for Terraform to exit or data loss may occur.
08:56:51.265 STDOUT terraform: Gracefully shutting down...
08:56:51.291 INFO   Second Child Exited signal received, force shutting down...



```
</details>